{
  "backend/main.mo": "Main actor implementing role-based access control with user profile management, allowlist gating, and admin endpoints for managing user roles (guest, user, admin).",
  "feature_evidence.json": "Empty feature evidence report placeholder with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing authentication flow, Valentine-themed UI components, gift screens, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining Valentine-themed design tokens for light and dark modes using CSS custom properties.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the Valentine's Day application.",
  "frontend/src/App.tsx": "Root component orchestrating authentication, allowlist checking, and conditional rendering of sign-in, access denied, or Valentine flow screens with loading states.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Screen displayed to authenticated users not on the allowlist, showing access denial message with logout functionality.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign-in screen with Internet Identity login button and Valentine-themed UI featuring animated hearts.",
  "frontend/src/components/layout/ValentineLayout.tsx": "Shared layout wrapper providing Valentine-themed background, floating decorative hearts, main content container, and footer with attribution.",
  "frontend/src/features/valentine/gifts/Gift1Song.tsx": "Displays an audio player for a song with play/pause controls, error handling, and scrollable lyrics in Punjabi. Uses Lucide icons and shadcn/ui components.",
  "frontend/src/features/valentine/gifts/Gift2Bouquet.tsx": "Renders a static virtual bouquet gift card displaying a flower image with decorative icons and a romantic message.",
  "frontend/src/features/valentine/gifts/Gift3Message.tsx": "Provides an editable heartfelt message with a reveal/hide toggle, allowing users to customize the default Valentine's message before displaying it in a styled card.",
  "frontend/src/features/valentine/gifts/Gift4Poem.tsx": "Displays a romantic Hindi poem in a decorative card with gradient backgrounds, heart icons, and emphasized typography.",
  "frontend/src/features/valentine/GiftsScreen.tsx": "Gift selection screen displaying four gift cards with navigation to individual gift components (song, bouquet, message, poem) and back navigation.",
  "frontend/src/features/valentine/QuestionScreen.tsx": "Valentine question screen with \"Yes\" button advancing to gifts and \"No\" button triggering a 1.5-second red alarm effect (shake, glow, flash) without navigation.",
  "frontend/src/features/valentine/ValentineFlow.tsx": "State machine component managing flow between question screen and gifts screen based on user interaction.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAllowlistGate.ts": "Hook that checks if the current authenticated user is on the allowlist by querying the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient with delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a Valentine's Day color theme (warm cream and romantic red) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations (accordion, alarm shake/flash), and font families.",
  "project_state.json": "Project state metadata indicating pending feature requests to restore the codebase to Version 3, with schema version 1.0.0 and project state version 5."
}