{
  "backend/main.mo": "Main Motoko actor implementing role-based access control (admin/user/guest) with user profile management and allowlist functionality using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a Valentine's Day web app with authentication, allowlist gating, question/answer flow, and four gifts (song, bouquet, message, poem).",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining Valentine-themed design tokens (warm cream background, deep red accents) for light and dark modes.",
  "frontend/index.html": "HTML entry point for the Valentine's Day private website application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component orchestrating authentication flow with Internet Identity, allowlist checking, and conditional rendering of sign-in, access denied, or Valentine flow screens.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied screen component with shield icon and logout button shown to authenticated users not on the allowlist.",
  "frontend/src/components/auth/SignInScreen.tsx": "Sign-in screen with animated heart icons and Internet Identity login button for Valentine-themed authentication.",
  "frontend/src/components/layout/ValentineLayout.tsx": "Shared layout wrapper providing Valentine-themed background image, floating decorative hearts, and footer with caffeine.ai attribution.",
  "frontend/src/features/valentine/gifts/Gift1Song.tsx": "Renders an audio player for a song with play/pause controls, error handling, and scrollable lyrics display. Uses Lucide icons and manages audio state with React hooks.",
  "frontend/src/features/valentine/gifts/Gift2Bouquet.tsx": "Displays a virtual bouquet gift with a decorative header, an image of flowers, and a romantic message. Simple presentational component with no interactive state.",
  "frontend/src/features/valentine/gifts/Gift3Message.tsx": "Shows an editable heartfelt message that can be customized in a textarea and then revealed in a styled card format. Includes toggle between edit and reveal modes.",
  "frontend/src/features/valentine/gifts/Gift4Poem.tsx": "Displays a romantic poem in Hindi/Punjabi with decorative styling, gradient backgrounds, and animated heart icons. Pure presentational component with no interactivity.",
  "frontend/src/features/valentine/GiftsScreen.tsx": "Gift selection screen displaying four gift cards with icons (Music, Flower, Heart, Sparkles) that navigate to individual gift reveal components with back navigation.",
  "frontend/src/features/valentine/QuestionScreen.tsx": "Valentine question screen with \"Yes\" button advancing flow and \"No\" button triggering repeatable red alarm effect (shake animation, red glow, flash overlay) for 1.5 seconds without navigation.",
  "frontend/src/features/valentine/ValentineFlow.tsx": "State machine component managing flow between question screen and gifts screen based on user interaction.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor for backend communication, handling identity changes and query invalidation. Initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAllowlistGate.ts": "Hook that checks if the current user's identity is on the allowlist by querying the backend actor. Returns allowlist status, loading state, and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with delegation identity management. Includes provider component and custom hook for accessing auth state throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving user profiles via the backend actor. Includes query for getting caller profile and mutation for saving with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a Valentine's Day theme featuring warm cream backgrounds and romantic red accents in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography, container queries, custom animations (accordion, alarm shake/flash), and extended theme properties.",
  "project_state.json": "Project metadata file indicating a pending feature request (AR-1) to restore the codebase to Version 3 state."
}